from 海龜模組 import *

層數 = 5
轉角 = 30 
長 = 200
長縮減率 = 0.7
寬 = 1
寬縮減率 = 1

def 初始化():
    視窗設定(1000, 1000)
    #背景顏色('black')
    #畫筆顏色('#ffffff')
    速度('fastest')
    停筆()
    走到(0,-200)
    設定方向(90)
    tracer(0, 0)
    
    
def 分支遞迴(層,長,寬):
    if 層 == 層數:
        # 層次限制，逐一返回
        畫點(5, 'red')
        return
    else:
        # 前進
        畫筆尺寸(寬)
        下筆()
        向前(長)
        
        
        
        停筆()
        
        # 右半遞迴
        右轉(轉角)
        
        分支遞迴(層+1,長*長縮減率, 寬*寬縮減率)
        
        # 右半遞迴
        左轉(轉角*2)
        
        
        分支遞迴(層+1,長*長縮減率, 寬*寬縮減率)
        
        # 後退    
        右轉(轉角)
        向後(長)

# 主程式
初始化()
while True :
    for i in range(0,90+1):
        轉角 = i
        筆跡清除()
        分支遞迴(0,長,寬)
        update()
    for i in reversed(range(0,90)):
        轉角 = i
        筆跡清除()
        分支遞迴(0, 長,寬)
        update()        
完成()
