from 海龜模組 import *
import random as 隨機
隨機.seed(1)
##four color
#葉色陣列 = ['#0cf520','#c2fc92','#218c1d','#cef542','#de355f','#edcd15']
##green
葉色陣列 = ['#40a600','#5ade07','#c5f759','#fff203']
## pink
#葉色陣列 = ['#fa697f','#f02b9b','#ee76f5','#b65cfa']
## gray
葉色陣列 = ['#f5f5f5','#d9d7d7','#fafafa','#c7c7c7']
def 初始化():
    視窗設定(1200, 800)
    背景顏色('#feffcc')
    背景顏色('black')
    
    畫筆顏色('#a64c17')
    畫筆顏色('white')
    隱藏游標()
    
    速度(0)
    停筆()
    走到(0,-500)
    設定方向(隨機.randint(85,95))    
    
def 葉():
    葉色 = 隨機.choice(葉色陣列)
    #葉色 = 'white'
    #向前(5)
    畫點(2, 葉色)
    
    for 數 in range(4) :
        
        向前(5)
        下筆()
        畫點(2, 葉色)
        停筆()
        向後(5)
        左轉(90)
    #向後(5)    
    
def 分支遞迴(層=0,粗細=10,長度=200):
    if 層 == 12:
        # 層次限制，逐一返回
        葉()           
        return
    elif 250 < 方向() <290 :
        # 角度限制，逐一返回
        #葉()
        return
    else:
#         if 層 > 3:
#             # 節點長葉
#             葉()
        
        # 前進
        畫筆尺寸(粗細)
        下筆()
        向前(長度)
        停筆()
        
        # 右半遞迴
        角度 = 隨機.randint(0,50)
        夾角 = 隨機.randint(30,60)
        右轉(角度)
        縮減1 = 隨機.uniform(0.6, 0.9)
        縮減2 = 隨機.uniform(0.6, 0.9)
        
        分支遞迴(層+1,粗細*縮減1, 長度*縮減2)
        
        # 右半遞迴
        左轉(夾角)
        縮減3 = 隨機.uniform(0.6, 0.9)
        縮減4 = 隨機.uniform(0.6, 0.9)
        
        分支遞迴(層+1,粗細*縮減3, 長度*縮減4)
        
        # 後退    
        右轉(夾角-角度)
        向後(長度)

# 主程式
初始化()
tracer(240, 0)
分支遞迴()

update()
完成()