from 海龜模組 import *
from itertools import cycle

速度('fastest')

視窗設定(1000, 1000)

顏色陣列 = ['red','white','white','pink',]
顏色循環 = cycle(顏色陣列)
停筆()


def 正方形(邊長) :
#     停筆()
#     向後(邊長/2)
#     左轉(90)
#     向前(邊長/2)
#     右轉(90)    
#     
#     下筆()
    
    
    開始填色()
    for 數 in range(5) :
        向前(邊長)
        右轉(180-180/5)
    停止填色()
    

#       開始填色()
#       畫圓(邊長)
#       停止填色()
      
# 
#     左轉(90)
#     向後(邊長/2)
#     右轉(90)
#     向前(邊長/2)


for 邊長 in range(255, 0, -5) :
    顏色 = next(顏色循環)
    
    填充顏色(顏色)
    正方形(邊長*2)
    右轉(60)
    
#     向前(2)
#     右轉(90)
#     向前(10)
#     左轉(95)
    
完成()
