from 物理模組 import *
舞台 = 物理引擎(800,2000)
舞台.重力 = [0, -800]

def 金字塔(x, y):
    for 橫 in range(10) :
        for 直 in range(10-橫) :
            物體 = 新增方塊(寬=20,高=20)
            物體.位置 = [x+ 橫*20+直*20/2, y+ 直*20]
            物體.密度 = 1


def 按下滑鼠時(x, y):
    物體 = 新增圓球(5)
    物體.位置 = [0, y]
    物體.密度 = 100
    物體.速度 = [10000, 100]    
           
def 按下鍵盤時(按鍵, x, y):
    if 按鍵 == key.UP :
        金字塔(x, y)
    if 按鍵 == key.SPACE :
        舞台.慢動作 = True
        
        
def 放開鍵盤時(按鍵, x, y):
    if 按鍵 == key.SPACE :
        舞台.慢動作 = False
        
    
    
模擬主迴圈()
