from 物理模組 import *
舞台 = 物理引擎(800,800)
舞台.重力 = [0, -800]

障礙物密度 = 1
撞擊物密度 = 1

def 金字塔(x, y):
    for 橫 in range(10) :
        for 直 in range(10-橫) :
            物體 = 新增方塊(寬=20,高=20)
            物體.位置 = [x+ 橫*20+直*20/2, y+ 直*20]
            物體.密度 = 障礙物密度

def 柱子(x, y):
    for 直 in range(10) :
        物體 = 新增方塊(寬=20,高=20)
        物體.位置 = [x, y+ 直*20]
        物體.密度 = 障礙物密度

def 牆面(x, y):
    for 橫 in range(10) :
        for 直 in range(10) :
            物體 = 新增方塊(寬=20,高=20)
            物體.位置 = [x + 橫*20, y + 直*20]
            物體.密度 = 障礙物密度
            
def 按下滑鼠時(x, y):
    物體 = 新增圓球(20)
    物體.位置 = [0, y]
    物體.密度 = 撞擊物密度
    向量 = [2000, 200]
    物體.施加衝力(向量)
            
def 按下鍵盤時(按鍵, x, y):
    if 按鍵 == key.UP :
        金字塔(x, y)    
    if 按鍵 == key.LEFT :
        柱形(x, y)        
    if 按鍵 == key.RIGHT :
        方陣(x, y)    
    if 按鍵 == key.SPACE :
        舞台.慢動作 = True
           
def 放開鍵盤時(按鍵, x, y):
    if 按鍵 == key.SPACE :
        舞台.慢動作 = False
        
模擬主迴圈()